#### Install all requirements for the project

In [1]:
# !pip install numpy
# !pip install pandas
# !pip install matplotlib
# !pip install seaborn

#### Importing Libraries

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Path
DOCS_PATH = 'docs/'
DATA_PATH = 'data/'

#### Importing our Datasets

In [3]:
commune_df = pd.read_excel((DATA_PATH + "commune.xlsx"))
enroll_df = pd.read_csv(DATA_PATH + "enroll.csv")
industry_df = pd.read_csv(DATA_PATH + "industry.csv")
ord_df = pd.read_csv(DATA_PATH + "ord.csv")
quest_df = pd.read_csv(DATA_PATH + "quest.csv")
studyd_df = pd.read_csv(DATA_PATH + "study_domain.csv")
tech_df = pd.read_csv(DATA_PATH + "technology.csv")
transaction_df = pd.read_csv(DATA_PATH + "transaction.csv")

# Ayiti Analytics Data Processing Bootcamp
  Ayiti Analytics Data wants to expand its training centers throughout all the communes of the country. Your role as a data analyst is to help them realize this dream.

Its objective is to know which three communes of the country will be the most likely to expand its training centers.

Knowing that each cohort must have 30 students
 
* How many applications must be made to select 25% women for each on average

* What are the most effective communication channels (Alumni, Facebook, WhatsApp, Friend ...) that will allow a student to be susceptible to selection
 
* What is the average number of university students who should participate in this program
* What will be the average number of applications per week that we could have
* How many weeks should we extend the application process to select 60 students per commune?
* If we were to do all the bootcamp online, who would be the best communes and how many applications would we need to select 30 student and what percentage of students would have a laptop, an internet connection, both at the same time
* What are the most effective communication channels (Alumni, Facebook, WhatsApp, Friend ...) that will allow a women to be susceptible to selection

### NB 
Use the same framework of the BA project to complete this project

>## Commune dataset

#### Display the Dataframe

In [4]:
commune_df.head(5)

      Commune_en     Commune_FR Commune_Id  Departement ADM1_PCODE
0       Abricots       Abricots     HT0812  Grande'Anse       HT08
1   Acul du Nord   Acul du Nord     HT0321        North       HT03
2  Anse-a-Foleur  Anse-à-Foleur     HT0922   North-West       HT09
3   Anse-a-Pitre   Anse-à-Pître     HT0234   South-East       HT02
4    Anse-a-Veau    Anse-à-Veau     HT1021       Nippes       HT10

#### Data overview

In [5]:
# Shapes
row, col = commune_df.shape
print("This datasset have",row,"rows","and",col,'columns')

This datasset have 140 rows and 5 columns

In [6]:
# Data Types
commune_df.dtypes

Commune_en     object
Commune_FR     object
Commune_Id     object
Departement    object
ADM1_PCODE     object
dtype: object

In [7]:
# Data info
commune_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140 entries, 0 to 139
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Commune_en   140 non-null    object
 1   Commune_FR   140 non-null    object
 2   Commune_Id   140 non-null    object
 3   Departement  140 non-null    object
 4   ADM1_PCODE   140 non-null    object
dtypes: object(5)
memory usage: 5.6+ KB

In [8]:
# Describe the dataset
commune_df.describe()

       Commune_en Commune_FR Commune_Id Departement ADM1_PCODE
count         140        140        140         140        140
unique        140        140        140          10         10
top       Maniche    Maniche     HT0716        West       HT01
freq            1          1          1          20         20

#### Data cleaning

In [9]:
# Make sure our columns don't have duplicate values.
commune_df.duplicated().sum()

0

In [10]:
# dealing with missing data
commune_df.isna().sum()

Commune_en     0
Commune_FR     0
Commune_Id     0
Departement    0
ADM1_PCODE     0
dtype: int64

**Conclusion:** just checking that there's no missing and duplicated values in the commune dataset...

>## Enroll Dataset

#### Import Dataset

In [11]:
# Affiche done enroll yo
enroll_df.head()

,Unnamed: 0,created_at,expiry_date,user_id,course_name,course_id,percentage_completed,completed_at,expired,is_free_trial,completed,started_at,activated_at,updated_at,quest_id
0,0,2020-12-12T06:41:29.844Z,NaN,29816173,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-12T06:41:29.844Z,NaN
1,1,2020-12-13T14:41:17.720Z,NaN,35229766,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-13T14:41:17.720Z,NaN
2,2,2020-12-15T00:53:06.499Z,NaN,31987560,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-15T00:53:06.499Z,NaN
3,3,2020-12-18T18:38:55.683Z,NaN,35616451,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-18T18:38:55.683Z,NaN
4,4,2020-12-21T14:45:06.528Z,NaN,35390649,Entwodiksyon Nan Syans Done,1047613,0.0,NaN,False,True,False,NaN,NaN,2020-12-21T14:45:06.528Z,NaN

#### Data overview

In [12]:
enroll_df.describe()

       Unnamed: 0       user_id  course_id  percentage_completed  completed_at
count  148.000000  1.480000e+02      148.0            148.000000           0.0
mean    73.500000  3.982423e+07  1047613.0              0.249925           NaN
std     42.868014  1.782956e+06        0.0              0.313651           NaN
min      0.000000  2.981617e+07  1047613.0              0.000000           NaN
25%     36.750000  3.989802e+07  1047613.0              0.000000           NaN
50%     73.500000  4.009749e+07  1047613.0              0.023810           NaN
75%    110.250000  4.062487e+07  1047613.0              0.418605           NaN
max    147.000000  4.159270e+07  1047613.0              0.953488           NaN

In [13]:
enroll_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148 entries, 0 to 147
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            148 non-null    int64
 1   created_at            148 non-null    object
 2   expiry_date           60 non-null     object
 3   user_id               148 non-null    int64
 4   course_name           148 non-null    object
 5   course_id             148 non-null    int64
 6   percentage_completed  148 non-null    float64
 7   completed_at          0 non-null      float64
 8   expired               148 non-null    bool
 9   is_free_trial         148 non-null    bool
 10  completed             148 non-null    bool
 11  started_at            135 non-null    object
 12  activated_at          77 non-null     object
 13  updated_at            148 non-null    object
 14  quest_id              102 non-null    object
dtypes: bool(3), float64(2), int64(3), object(7)
memory usage: 14.4+ KB

#### Data cleaning

In [14]:
# Finding duplicated rows
print(enroll_df.duplicated().sum(),"Duplicated rows")

0 Duplicated rows

In [15]:
# Count how many missing values we have in this dataset
enroll_df.isnull().sum()

Unnamed: 0                0
created_at                0
expiry_date              88
user_id                   0
course_name               0
course_id                 0
percentage_completed      0
completed_at            148
expired                   0
is_free_trial             0
completed                 0
started_at               13
activated_at             71
updated_at                0
quest_id                 46
dtype: int64

In [16]:
# Total missing values we have
print("We have", enroll_df.isnull().sum().sum(), "missing values in this dataset")

We have 366 missing values in this dataset

In [17]:
# Dealing with our null values
clean_enroll_df = enroll_df.fillna(value = 0)
print("We have", clean_enroll_df.isnull().sum().sum(), "missing value")

We have 0 missing value

In [19]:
# Our cleaned Dataframe
clean_enroll_df.head(3)

,Unnamed: 0,created_at,expiry_date,user_id,course_name,course_id,percentage_completed,completed_at,expired,is_free_trial,completed,started_at,activated_at,updated_at,quest_id
0,0,2020-12-12T06:41:29.844Z,0,29816173,Entwodiksyon Nan Syans Done,1047613,0.0,0.0,False,True,False,0,0,2020-12-12T06:41:29.844Z,0
1,1,2020-12-13T14:41:17.720Z,0,35229766,Entwodiksyon Nan Syans Done,1047613,0.0,0.0,False,True,False,0,0,2020-12-13T14:41:17.720Z,0
2,2,2020-12-15T00:53:06.499Z,0,31987560,Entwodiksyon Nan Syans Done,1047613,0.0,0.0,False,True,False,0,0,2020-12-15T00:53:06.499Z,0

**Conclusion:** All the missing values in the Enroll dataset have either been filled with 0 as new value.
Also we will be using our new dataframe called **clean_enroll_df**

>## Industry Dataset

In [20]:
# Affiche done industry yo
industry_df.head(3)

,Unnamed: 0,key,values,quest_id
0,0,item1,Finance,905ddcf2-ce95-11eb-9a92-7c67a234f601
1,1,item6,Technology (Software/ Internet),905e2608-ce95-11eb-809f-7c67a234f601
2,2,item5,Education,905e2608-ce95-11eb-809f-7c67a234f601

>## Ord Dataset

In [21]:
# Affiche done ord yo
ord_df.head(3)

,Unnamed: 0,created_at,user_id,product_name,product_id,amount_dollars,amount_cents,subscription,coupon_code,coupon_id,affiliate_referral_code,status,quest_id
0,0,2021-03-14T15:34:35.014Z,41587952,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906b3c86-ce95-11eb-b6a7-7c67a234f601
1,1,2021-03-14T04:20:23.483Z,41564742,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906636cf-ce95-11eb-8679-7c67a234f601
2,2,2021-03-12T19:29:22.832Z,41501853,Entwodiksyon Nan Syans Done,1100636,20,2000,False,NaN,NaN,NaN,Complete,906968f5-ce95-11eb-9e1a-7c67a234f601

#### Data overview

In [22]:
ord_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               18 non-null     int64
 1   created_at               18 non-null     object
 2   user_id                  18 non-null     int64
 3   product_name             18 non-null     object
 4   product_id               18 non-null     int64
 5   amount_dollars           18 non-null     int64
 6   amount_cents             18 non-null     int64
 7   subscription             18 non-null     bool
 8   coupon_code              4 non-null      object
 9   coupon_id                4 non-null      float64
 10  affiliate_referral_code  0 non-null      float64
 11  status                   18 non-null     object
 12  quest_id                 14 non-null     object
dtypes: bool(1), float64(2), int64(5), object(5)
memory usage: 1.8+ KB

In [23]:
ord_df.shape

(18, 13)

In [24]:
ord_df.describe()

,Unnamed: 0,user_id,product_id,amount_dollars,amount_cents,coupon_id,affiliate_referral_code
count,18.000000,1.800000e+01,18.0,18.000000,18.000000,4.000000e+00,0.0
mean,8.500000,3.978105e+07,1100636.0,15.555556,1555.555556,6.535246e+06,NaN
std,5.338539,1.879479e+06,0.0,8.555853,855.585264,8.718553e+04,NaN
min,0.000000,3.485615e+07,1100636.0,0.000000,0.000000,6.452874e+06,NaN
25%,4.250000,3.989797e+07,1100636.0,20.000000,2000.000000,6.498275e+06,NaN
50%,8.500000,4.020500e+07,1100636.0,20.000000,2000.000000,6.514828e+06,NaN
75%,12.750000,4.038378e+07,1100636.0,20.000000,2000.000000,6.551799e+06,NaN
max,17.000000,4.158795e+07,1100636.0,20.000000,2000.000000,6.658457e+06,NaN

#### Data cleaning

In [25]:
# Duplicated rows
print(ord_df.duplicated().sum(), "Duplicated rows")

0 Duplicated rows

In [26]:
# Show how many missing values we have in this dataset
ord_df.isnull().sum()

Unnamed: 0                  0
created_at                  0
user_id                     0
product_name                0
product_id                  0
amount_dollars              0
amount_cents                0
subscription                0
coupon_code                14
coupon_id                  14
affiliate_referral_code    18
status                      0
quest_id                    4
dtype: int64

In [27]:
# Count all of our missing values
print(ord_df.isnull().sum().sum(), "Null values")

50 Null values

In [28]:
# Dealing with our missing values
clean_ord_df = ord_df.fillna(value=0)

In [36]:
print("Now we have", clean_ord_df.isnull().sum().sum(), "missing value")

Now we have 0 missing value

>## Questions dataset

In [39]:
# Affiche done quest yo
quest_df.head(3)

,Unnamed: 0,gender,dob,commune,created_at,modified_at,department,education_level,university,study_domain,current_employed,formal_sector_job,have_computer_home,internet_at_home,hear_AA_1,after_AA,quest_id
0,0,male,25/08/1998,ht0111,2021-02-14T23:03:52.768400Z,2021-02-14T23:03:52.768462Z,NaN,unknown,unknown,[],unknown,unknown,unknown,unknown,unknown,unknown,905dc006-ce95-11eb-b2f9-7c67a234f601
1,1,female,29/09/1996,ht0111,2021-02-16T16:01:10.861844Z,2021-02-16T16:01:10.861899Z,ht01,Bachelors (bacc +4),other,['other'],No,unknown,Yes,Yes,Friend,Finding a job/internship,905ddcf2-ce95-11eb-9a92-7c67a234f601
2,2,male,17/05/1996,ht0111,2021-02-16T16:56:30.579504Z,2021-02-16T16:56:30.579563Z,ht01,Bachelors (bacc +4),Université d'Etat d'Haïti (UEH),[],No,unknown,Yes,Yes,Friend,Improving my data analysis skills,905e2608-ce95-11eb-809f-7c67a234f601

>## Study domain Dataset

In [68]:
# Affiche done Study domain yo
studyd_df.head(3)

   Unnamed: 0    key            values                              quest_id
0           0  other             other  905ddcf2-ce95-11eb-9a92-7c67a234f601
1           1  item1  Computer Science  905e4cf5-ce95-11eb-96a9-7c67a234f601
2           2  item6        Management  905e4cf5-ce95-11eb-96a9-7c67a234f601

>## Technology Dataset

In [69]:
# Affiche done technology yo
tech_df.head(3)

   Unnamed: 0     key  values                              quest_id
0           0   item1       R  905ddcf2-ce95-11eb-9a92-7c67a234f601
1           1  item11   Excel  905ddcf2-ce95-11eb-9a92-7c67a234f601
2           2   item2  Python  905e2608-ce95-11eb-809f-7c67a234f601

>## Transaction dataset

In [70]:
# Affiche done industry yo
transaction_df.head(3)

,Unnamed: 0,created_at,modified_at,user_id,course_id,transaction_id
0,0,2021-03-08T05:08:50.832Z,2021-03-08T05:08:50.832Z,40976440,1047613,4641281952
1,1,2021-03-08T17:26:35.841Z,2021-03-08T17:26:35.841Z,41179271,1047613,4644270160
2,2,2021-03-08T18:52:09.147Z,2021-03-08T18:52:09.147Z,40973512,1047613,4645070622

## Question 1. How many applications must be made to select 25% women for each on average

## Question 2. What are the most effective communication channels (Alumni, Facebook, WhatsApp, Friend ...) that will allow a student to be susceptible to selection

## Question 3. What is the average number of university students who should participate in this program

## Question 4. What will be the average number of applications per week that we could have

## Question 5. How many weeks should we extend the application process to select 60 students per commune?

## Question 6. If we were to do all the bootcamp online, who would be the best communes and how many applications would we need to select 30 student and what percentage of students would have a laptop, an internet connection, both at the same time

## Question 7. What are the most effective communication channels (Alumni, Facebook, WhatsApp, Friend ...) that will allow a women to be susceptible to selection